PANDAS 05

#5: Membalik urutan baris dan kolom pada data frame

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  2  9  8  4  5
1  6  5  4  6  4
2  3  6  7  7  3
3  1  6  8  1  6
4  9  3  5  3  9

Membalik urutan kolom

In [3]:
df.loc[:, ::-1]

   E  D  C  B  A
0  5  4  8  9  2
1  4  6  4  5  6
2  3  7  7  6  3
3  6  1  8  6  1
4  9  3  5  3  9

Membalik urutan baris

In [4]:
df.loc[::-1]

   A  B  C  D  E
4  9  3  5  3  9
3  1  6  8  1  6
2  3  6  7  7  3
1  6  5  4  6  4
0  2  9  8  4  5

Membalik urutan baris dan melakukan penyesuaian ulang index

In [5]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  9  3  5  3  9
1  1  6  8  1  6
2  3  6  7  7  3
3  6  5  4  6  4
4  2  9  8  4  5

PANDAS 06

#6: Mengganti nama/label kolom pada data frame

In [8]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  7  3     5  3  4
1  1  3     9  5  6
2  7  6     7  4  1
3  5  1     2  3  7
4  1  7     9  2  7

Mengganti nama/label untuk banyak (sekaligus) kolom pada data frame

In [9]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     7       3  5     3  4
1     1       3  9     5  6
2     7       6  7     4  1
3     5       1  2     3  7
4     1       7  9     2  7

PANDAS 07

#7: Menghapus missing values pada data frame

In [10]:
import pandas as pd

print(pd.__version__)

2.3.3

In [11]:
n_rows = 30
n_cols = 4
cols = ['A', 'B', 'C', 'D']

df = pd.DataFrame(np.random.randn(n_rows, n_cols), columns=cols)

nan_mask = np.random.rand(n_rows, n_cols) < 0.2
df[nan_mask] = np.nan

df = df.reset_index()
df.head()

   index         A         B         C         D
0      0 -1.340199  0.944005  0.403973 -1.058737
1      1 -0.891974  0.303649 -1.682482  0.656553
2      2 -0.792383  0.626706  0.430733       NaN
3      3 -0.634370  0.082965  1.232087  0.059217
4      4 -0.775933 -0.058471 -1.034963  0.995769

In [12]:
df = df.rename(columns={'index':'Z'})
df.head()

   Z         A         B         C         D
0  0 -1.340199  0.944005  0.403973 -1.058737
1  1 -0.891974  0.303649 -1.682482  0.656553
2  2 -0.792383  0.626706  0.430733       NaN
3  3 -0.634370  0.082965  1.232087  0.059217
4  4 -0.775933 -0.058471 -1.034963  0.995769

In [13]:
df_backup = df.copy(deep=True)

Menghapus setiap kolom yang mengandung missing values

In [14]:
df = df.dropna(axis='columns') 
df.head()

   Z
0  0
1  1
2  2
3  3
4  4

Menghapus setiap baris yang mengandung missing values

In [15]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

   Z         A         B         C         D
0  0 -1.340199  0.944005  0.403973 -1.058737
1  1 -0.891974  0.303649 -1.682482  0.656553
3  3 -0.634370  0.082965  1.232087  0.059217
4  4 -0.775933 -0.058471 -1.034963  0.995769
5  5  0.775960 -1.543645 -0.768391  0.474557

Persentase missing values untuk tiap kolom

In [16]:
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.100000
B    0.200000
C    0.200000
D    0.166667
dtype: float64

Menghapus setiap kolom yang mengandung missing values berdasarkan threshold

In [17]:
treshold = len(df) * 0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

   Z         A
0  0 -1.340199
1  1 -0.891974
2  2 -0.792383
3  3 -0.634370
4  4 -0.775933

PANDAS 08

#8: Memeriksa kesamaan antar dua buah kolom pada data frame

In [18]:
data = {'A':[15, 15, 18, np.nan, 12], 
        'B':[15, 15, 18, np.nan, 12]}

df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

In [19]:
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [20]:
type(df['A'])

pandas.core.series.Series

In [21]:
type(df)

pandas.core.frame.DataFrame

Mengecek kesamaan dengan operator ==

In [22]:
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

Mengecek kesamaan dengan method equals()

In [23]:

df['A'].equals(df['B'])

True

Mengecek kesamaan antar dua data frame

In [24]:
df1 = df.copy(deep=True)

df.equals(df1)

True

In [25]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True